stressTest.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 1
      name: 1 User
    - duration: 60
      arrivalRate: 10
      name: 10 Users
    - duration: 60
      arrivalRate: 100
      name: 100 Users
    - duration: 60
      arrivalRate: 1000
      name: 1000 Users
  payload:
    -
      path: "./stressTestProd.csv"
      fields:
        - "product_id"
      skipHeader: true
    -
      path: "./stressTestQ.csv"
      fields:
        - "question_id"
      skipHeader: true
    -
      path: "./stressTestA.csv"
      fields:
        - "answer_id"
      skipHeader: true

scenarios:
  - name: "Initial Load"
    weight: 5
    flow:
      - get:
          url: "/qa/{{ product_id }}"
  - name: "Add Question"
    weight: 1
    flow:
      - post:
          url: "/qa/{{ product_id }}"
          json:
            name: "test"
            email: "test@test.com"
            body: "stress tester"
  - name: "Add Answer"
    weight: 1
    flow:
      - post:
          url: "/qa/{{ question_id }}/answers"
          json:
            name: "test"
            email: "test@test.com"
            body: "stress test answer"
            photos: "https://picsum.photos/800/600"
  - name: "Question Helpful"
    weight: 1
    flow:
      - put:
          url: "/qa/question/{{ question_id }}/helpful"
  - name: "Answer Helpful"
    weight: 1
    flow:
      - put:
          url: "/qa/answer/{{ answer_id }}/helpful"